In [56]:
import pandas as pd


df = pd.read_csv('developer_dataset.csv', low_memory=False)

In [57]:
maxRows = df['RespondentID'].count()

print('% Missing Data:')
print((1 - df.count() / maxRows) * 100)

% Missing Data:
RespondentID               0.000000
Year                       0.000000
Country                    0.000000
Employment                 1.604187
UndergradMajor            11.470295
DevType                    9.689863
LanguageWorkedWith         8.264619
LanguageDesireNextYear    13.636486
DatabaseWorkedWith        22.794918
DatabaseDesireNextYear    33.248208
PlatformWorkedWith        17.624473
PlatformDesireNextYear    23.229235
Hobbyist                  38.537349
OrgSize                   50.719816
YearsCodePro              14.761395
JobSeek                   45.547573
ConvertedComp             17.872654
WorkWeekHrs               54.060373
NEWJobHunt                82.800852
NEWJobHuntResearch        83.200101
NEWLearn                  78.215792
dtype: float64

In [66]:


df[['Country', 'Employment', 'DevType']].sample(n=20)

,Country,Employment,DevType
95502,Spain,Employed full-time,"Developer, full-stack"
26652,United States,Employed full-time,Back-end developer;Desktop or enterprise appli...
8068,United States,Employed full-time,"Developer, front-end"
81716,Germany,Employed full-time,"Developer, back-end;Developer, front-end;Devel..."
43341,United States,Employed full-time,DevOps specialist
14269,United States,"Not employed, but looking for work",Academic researcher;Student
74453,United Kingdom,Student,NaN
76268,United Kingdom,Employed full-time,NaN
27547,United States,Employed full-time,"Developer, full-stack;System administrator"
61612,United States,Employed full-time,"Developer, full-stack"
37133,United States,Employed part-time,"Database administrator;Developer, back-end;Dev..."
66778,Canada,Employed part-time,Student
99286,United Kingdom,Employed full-time,"Developer, full-stack"
92279,Germany,NaN,Back-end developer;Desktop or enterprise appli...
43653,United States,Employed full-time,Full-stack developer
101762,United Kingdom,Employed full-time,Academic researcher;Data scientist or machine ...
58182,United States,"Independent contractor, freelancer, or self-em...",Marketing or sales professional
52288,United States,Employed full-time,"Database administrator;Engineer, data"
55750,United States,Employed full-time,"Developer, back-end;Developer, full-stack;Deve..."
26320,United States,Employed full-time,"Developer, back-end;Developer, front-end;Devel..."

In [78]:
df.loc[df['Employment'] == 'Student', ['Country', 'Employment', 'DevType']]

             Country Employment DevType
26     United States    Student     NaN
65     United States    Student     NaN
71     United States    Student     NaN
80     United States    Student     NaN
101    United States    Student     NaN
...              ...        ...     ...
79943          Japan    Student     NaN
79952          Japan    Student     NaN
80000          Japan    Student     NaN
80006          Japan    Student     NaN
80123          Japan    Student     NaN

[2789 rows x 3 columns]